app/views/carts/_order_summary.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["cart_id", 1], ["item_id", 3], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
              <dt class="text-gray-500 dark:text-gray-400">Prix brut</dt>
              <dd class="text-base font-medium text-gray-900 dark:text-white"><%= cart_items.sum {|cart_item| cart_item.item.price * cart_item.quantity} %></dd>