app/controllers/application_controller.rb

  def current_cart
    if session[:cart_id]
      @current_cart ||= Cart.find(session[:cart_id])
      session[:cart_id] = nil if @current_cart.nil?
    end
    if session[:cart_id].nil?
      @current_cart = Cart.create!
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?) RETURNING "id"  [["created_at", "2024-09-13 11:54:57.373912"], ["updated_at", "2024-09-13 11:54:57.373912"]]