app/controllers/cart_items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" IN (?, ?, ?)  [["id", 1], ["id", 3], ["id", 2]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["cart_id", 1], ["item_id", 6], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 2], ["updated_at", "2024-09-13 13:19:54.095501"], ["id", 6]]
INSERT INTO "cart_items" ("cart_id", "item_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["cart_id", 1], ["item_id", 6], ["quantity", 1], ["created_at", "2024-09-13 13:19:53.958866"], ["updated_at", "2024-09-13 13:19:53.958866"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?) RETURNING "id"  [["created_at", "2024-09-13 13:44:30.220136"], ["updated_at", "2024-09-13 13:44:30.220136"]]
---
  def create
    @cart_items = current_cart.cart_items.preload(:item)
    @cart_item = @cart_items.find_by(item: @item)
    if @cart_item
      @cart_item.quantity += 1
      @cart_item.save
    else
      CartItem.create(cart: current_cart, item: @item, quantity: 1)

UPDATE "cart_items" SET "quantity" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["quantity", 5], ["updated_at", "2024-09-13 13:18:03.376405"], ["id", 3]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 5]]
---
  def destroy
    if @cart_item
      @cart_item.quantity -= 1
      @cart_item.save
      @cart_item.destroy if @cart_item.quantity.zero?

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_cart_item
    @cart_item = CartItem.find(params[:id])

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
---
  def set_item
    @item = Item.find(params[:item_id])