app/controllers/markets_controller.rb

SELECT "markets".* FROM "markets"
---
  def index
    @markets = Market.all

SELECT "markets".* FROM "markets" WHERE "markets"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_market
    @market = Market.find(params[:id])