app/views/markets/index.html.erb

SELECT COUNT(*) FROM "items" WHERE "items"."market_id" = ?  [["market_id", 6]]
---
        <h5 class="mb-2 text-2xl font-bold tracking-tight text-gray-900 dark:text-white"><%= market.name %></h5>
        <p class="font-normal text-gray-700 dark:text-gray-400"><%= market.items.count %> articles disponible.</p>