app/models/cart.rb

  def add_item(item)
    cart_item = cart_items.find_by(item: item)
    if cart_item
      cart_item.quantity += 1
      cart_item.save
    else
      cart_items.create(cart: self, item: item, quantity: 1)
---
INSERT INTO "cart_items" ("cart_id", "item_id", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["cart_id", 1], ["item_id", 20], ["quantity", 1], ["created_at", "2024-09-13 12:41:04.788932"], ["updated_at", "2024-09-13 12:41:04.788932"]]